### SF Salaries Example

Import pandas as pd

In [1]:
import pandas as pd

Read Salaries.csv as a dataframe called sal

In [2]:
sal = pd.read_csv(r'../Datasets/Salaries.csv',low_memory=False)

Check the head of the DataFrame

In [3]:
sal.head(2)

,Id,EmployeeName,JobTitle,BasePay,OvertimePay,OtherPay,Benefits,TotalPay,TotalPayBenefits,Year,Notes,Agency,Status
0,1,NATHANIEL FORD,GENERAL MANAGER-METROPOLITAN TRANSIT AUTHORITY,167411.18,0.0,400184.25,NaN,567595.43,567595.43,2011,NaN,San Francisco,NaN
1,2,GARY JIMENEZ,CAPTAIN III (POLICE DEPARTMENT),155966.02,245131.88,137811.38,NaN,538909.28,538909.28,2011,NaN,San Francisco,NaN

### Use the ``.info()`` method to find out how many entries in the dataset

In [4]:
sal.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 148654 entries, 0 to 148653
Data columns (total 13 columns):
 #   Column            Non-Null Count   Dtype
---  ------            --------------   -----
 0   Id                148654 non-null  int64
 1   EmployeeName      148654 non-null  object
 2   JobTitle          148654 non-null  object
 3   BasePay           148049 non-null  object
 4   OvertimePay       148654 non-null  object
 5   OtherPay          148654 non-null  object
 6   Benefits          112495 non-null  object
 7   TotalPay          148654 non-null  float64
 8   TotalPayBenefits  148654 non-null  float64
 9   Year              148654 non-null  int64
 10  Notes             0 non-null       float64
 11  Agency            148654 non-null  object
 12  Status            38119 non-null   object
dtypes: float64(3), int64(2), object(8)
memory usage: 14.7+ MB

#### Check dimensionality of the DataFrame

In [5]:
sal.shape

print(f"DataFrame has {sal.shape[0]} rows & {sal.shape[1]} columns")

DataFrame has 148654 rows & 13 columns

### Check the null values in the dataset

In [6]:
sal.isna().sum()

#or

#sal.isnull().sum()

Id                       0
EmployeeName             0
JobTitle                 0
BasePay                605
OvertimePay              0
OtherPay                 0
Benefits             36159
TotalPay                 0
TotalPayBenefits         0
Year                     0
Notes               148654
Agency                   0
Status              110535
dtype: int64

### Data Cleaning

For data cleaning make the copy of dataset and perform the operations on it.

In [7]:
clean=sal.copy()

clean.head(2)

,Id,EmployeeName,JobTitle,BasePay,OvertimePay,OtherPay,Benefits,TotalPay,TotalPayBenefits,Year,Notes,Agency,Status
0,1,NATHANIEL FORD,GENERAL MANAGER-METROPOLITAN TRANSIT AUTHORITY,167411.18,0.0,400184.25,NaN,567595.43,567595.43,2011,NaN,San Francisco,NaN
1,2,GARY JIMENEZ,CAPTAIN III (POLICE DEPARTMENT),155966.02,245131.88,137811.38,NaN,538909.28,538909.28,2011,NaN,San Francisco,NaN

### Handling Missing Values

#### Drop Notes and Status column as they have maximum null values

In [8]:
clean.drop("Notes",axis=1,inplace=True)

clean.head()

,Id,EmployeeName,JobTitle,BasePay,OvertimePay,OtherPay,Benefits,TotalPay,TotalPayBenefits,Year,Agency,Status
0,1,NATHANIEL FORD,GENERAL MANAGER-METROPOLITAN TRANSIT AUTHORITY,167411.18,0.0,400184.25,NaN,567595.43,567595.43,2011,San Francisco,NaN
1,2,GARY JIMENEZ,CAPTAIN III (POLICE DEPARTMENT),155966.02,245131.88,137811.38,NaN,538909.28,538909.28,2011,San Francisco,NaN
2,3,ALBERT PARDINI,CAPTAIN III (POLICE DEPARTMENT),212739.13,106088.18,16452.6,NaN,335279.91,335279.91,2011,San Francisco,NaN
3,4,CHRISTOPHER CHONG,WIRE ROPE CABLE MAINTENANCE MECHANIC,77916.0,56120.71,198306.9,NaN,332343.61,332343.61,2011,San Francisco,NaN
4,5,PATRICK GARDNER,"DEPUTY CHIEF OF DEPARTMENT,(FIRE DEPARTMENT)",134401.6,9737.0,182234.59,NaN,326373.19,326373.19,2011,San Francisco,NaN

In [9]:
clean.drop("Status",axis=1,inplace=True)

clean.head(1)

,Id,EmployeeName,JobTitle,BasePay,OvertimePay,OtherPay,Benefits,TotalPay,TotalPayBenefits,Year,Agency
0,1,NATHANIEL FORD,GENERAL MANAGER-METROPOLITAN TRANSIT AUTHORITY,167411.18,0.0,400184.25,NaN,567595.43,567595.43,2011,San Francisco

In [10]:
clean.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 148654 entries, 0 to 148653
Data columns (total 11 columns):
 #   Column            Non-Null Count   Dtype
---  ------            --------------   -----
 0   Id                148654 non-null  int64
 1   EmployeeName      148654 non-null  object
 2   JobTitle          148654 non-null  object
 3   BasePay           148049 non-null  object
 4   OvertimePay       148654 non-null  object
 5   OtherPay          148654 non-null  object
 6   Benefits          112495 non-null  object
 7   TotalPay          148654 non-null  float64
 8   TotalPayBenefits  148654 non-null  float64
 9   Year              148654 non-null  int64
 10  Agency            148654 non-null  object
dtypes: float64(2), int64(2), object(7)
memory usage: 12.5+ MB

In [11]:
clean.isna().sum()

Id                      0
EmployeeName            0
JobTitle                0
BasePay               605
OvertimePay             0
OtherPay                0
Benefits            36159
TotalPay                0
TotalPayBenefits        0
Year                    0
Agency                  0
dtype: int64

In [12]:
clean.head()

,Id,EmployeeName,JobTitle,BasePay,OvertimePay,OtherPay,Benefits,TotalPay,TotalPayBenefits,Year,Agency
0,1,NATHANIEL FORD,GENERAL MANAGER-METROPOLITAN TRANSIT AUTHORITY,167411.18,0.0,400184.25,NaN,567595.43,567595.43,2011,San Francisco
1,2,GARY JIMENEZ,CAPTAIN III (POLICE DEPARTMENT),155966.02,245131.88,137811.38,NaN,538909.28,538909.28,2011,San Francisco
2,3,ALBERT PARDINI,CAPTAIN III (POLICE DEPARTMENT),212739.13,106088.18,16452.6,NaN,335279.91,335279.91,2011,San Francisco
3,4,CHRISTOPHER CHONG,WIRE ROPE CABLE MAINTENANCE MECHANIC,77916.0,56120.71,198306.9,NaN,332343.61,332343.61,2011,San Francisco
4,5,PATRICK GARDNER,"DEPUTY CHIEF OF DEPARTMENT,(FIRE DEPARTMENT)",134401.6,9737.0,182234.59,NaN,326373.19,326373.19,2011,San Francisco

In [13]:
clean.tail()

,Id,EmployeeName,JobTitle,BasePay,OvertimePay,OtherPay,Benefits,TotalPay,TotalPayBenefits,Year,Agency
148649,148650,Roy I Tillery,Custodian,0.00,0.00,0.00,0.00,0.00,0.00,2014,San Francisco
148650,148651,Not provided,Not provided,Not Provided,Not Provided,Not Provided,Not Provided,0.00,0.00,2014,San Francisco
148651,148652,Not provided,Not provided,Not Provided,Not Provided,Not Provided,Not Provided,0.00,0.00,2014,San Francisco
148652,148653,Not provided,Not provided,Not Provided,Not Provided,Not Provided,Not Provided,0.00,0.00,2014,San Francisco
148653,148654,Joe Lopez,"Counselor, Log Cabin Ranch",0.00,0.00,-618.13,0.00,-618.13,-618.13,2014,San Francisco

In [14]:
clean[clean["BasePay"]=="Not Provided"]

,Id,EmployeeName,JobTitle,BasePay,OvertimePay,OtherPay,Benefits,TotalPay,TotalPayBenefits,Year,Agency
148646,148647,Not provided,Not provided,Not Provided,Not Provided,Not Provided,Not Provided,0.0,0.0,2014,San Francisco
148650,148651,Not provided,Not provided,Not Provided,Not Provided,Not Provided,Not Provided,0.0,0.0,2014,San Francisco
148651,148652,Not provided,Not provided,Not Provided,Not Provided,Not Provided,Not Provided,0.0,0.0,2014,San Francisco
148652,148653,Not provided,Not provided,Not Provided,Not Provided,Not Provided,Not Provided,0.0,0.0,2014,San Francisco

In [15]:
# Get the index values where the base pay is not provided then drop those rows from the dataset
x = clean[clean["BasePay"]=="Not Provided"].index
x

Int64Index([148646, 148650, 148651, 148652], dtype='int64')

In [16]:
clean.drop( x, inplace=True)
clean.tail()

,Id,EmployeeName,JobTitle,BasePay,OvertimePay,OtherPay,Benefits,TotalPay,TotalPayBenefits,Year,Agency
148645,148646,Carolyn A Wilson,Human Services Technician,0.00,0.00,0.00,0.00,0.00,0.00,2014,San Francisco
148647,148648,Joann Anderson,Communications Dispatcher 2,0.00,0.00,0.00,0.00,0.00,0.00,2014,San Francisco
148648,148649,Leon Walker,Custodian,0.00,0.00,0.00,0.00,0.00,0.00,2014,San Francisco
148649,148650,Roy I Tillery,Custodian,0.00,0.00,0.00,0.00,0.00,0.00,2014,San Francisco
148653,148654,Joe Lopez,"Counselor, Log Cabin Ranch",0.00,0.00,-618.13,0.00,-618.13,-618.13,2014,San Francisco

In [17]:
clean[clean["BasePay"]=="Not Provided"].index

Int64Index([], dtype='int64')

In [18]:
# Change the data type of "BasePay","OvertimePay","OtherPay","Benefits" into float as they are in object type

convert=["BasePay","OvertimePay","OtherPay","Benefits"]
for col in convert:
    clean[col]=clean[col].astype("float64")
    
clean.head(1)

,Id,EmployeeName,JobTitle,BasePay,OvertimePay,OtherPay,Benefits,TotalPay,TotalPayBenefits,Year,Agency
0,1,NATHANIEL FORD,GENERAL MANAGER-METROPOLITAN TRANSIT AUTHORITY,167411.18,0.0,400184.25,NaN,567595.43,567595.43,2011,San Francisco

In [19]:
# Now check the data type is changed or not

clean.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 148650 entries, 0 to 148653
Data columns (total 11 columns):
 #   Column            Non-Null Count   Dtype
---  ------            --------------   -----
 0   Id                148650 non-null  int64
 1   EmployeeName      148650 non-null  object
 2   JobTitle          148650 non-null  object
 3   BasePay           148045 non-null  float64
 4   OvertimePay       148650 non-null  float64
 5   OtherPay          148650 non-null  float64
 6   Benefits          112491 non-null  float64
 7   TotalPay          148650 non-null  float64
 8   TotalPayBenefits  148650 non-null  float64
 9   Year              148650 non-null  int64
 10  Agency            148650 non-null  object
dtypes: float64(6), int64(2), object(3)
memory usage: 13.6+ MB

In [78]:
# Describe the dataset

clean.describe().round(2)

,Id,BasePay,OvertimePay,OtherPay,Benefits,TotalPay,TotalPayBenefits,Year
count,148650.00,148650.00,148650.00,148650.00,148650.00,148650.00,148650.00,148650.00
mean,74325.50,66055.51,5066.06,3648.77,18924.74,74770.33,93695.08,2012.52
std,42911.70,42885.92,11454.38,8056.60,17165.23,50516.20,62792.50,1.12
min,1.00,-166.01,-0.01,-7058.59,-33.89,-618.13,-618.13,2011.00
25%,37163.25,32798.55,0.00,0.00,0.00,36169.96,44073.34,2012.00
50%,74325.50,64862.31,0.00,811.27,23217.14,71427.24,92406.02,2013.00
75%,111487.75,94609.72,4658.18,4236.07,33468.98,105842.96,132877.99,2014.00
max,148654.00,319275.01,245131.88,400184.25,96570.66,567595.43,567595.43,2014.00

In [79]:
clean.describe(exclude= 'number')

       EmployeeName          JobTitle         Agency
count        148650            148650         148650
unique       110810              2158              1
top       Kevin Lee  Transit Operator  San Francisco
freq             13              7036         148650

In [22]:
# Find the correlation between the columns using 'corr()' function

clean.corr()

,Id,BasePay,OvertimePay,OtherPay,Benefits,TotalPay,TotalPayBenefits,Year
Id,1.000000,-0.204878,-0.081505,-0.100403,-0.348957,-0.211424,-0.092127,0.968172
BasePay,-0.204878,1.000000,0.266740,0.285655,0.918028,0.954494,0.946595,0.033751
OvertimePay,-0.081505,0.266740,1.000000,0.316592,0.301207,0.504859,0.467981,0.027887
OtherPay,-0.100403,0.285655,0.316592,1.000000,0.233178,0.470496,0.422341,-0.002499
Benefits,-0.348957,0.918028,0.301207,0.233178,1.000000,0.884097,0.930140,-0.043136
TotalPay,-0.211424,0.954494,0.504859,0.470496,0.884097,1.000000,0.977312,0.032145
TotalPayBenefits,-0.092127,0.946595,0.467981,0.422341,0.930140,0.977312,1.000000,0.152009
Year,0.968172,0.033751,0.027887,-0.002499,-0.043136,0.032145,0.152009,1.000000

#### Check the null values in the Base Pay

In [23]:
clean[clean["BasePay"].isna()]

,Id,EmployeeName,JobTitle,BasePay,OvertimePay,OtherPay,Benefits,TotalPay,TotalPayBenefits,Year,Agency
81391,81392,Kevin P Cashman,Deputy Chief 3,NaN,0.0,149934.11,0.00,149934.11,149934.11,2013,San Francisco
84506,84507,Demetrya Mullens,Licensed Vocational Nurse,NaN,0.0,110485.41,20779.00,110485.41,131264.41,2013,San Francisco
84960,84961,Michael M Horan,Park Patrol Officer,NaN,0.0,120000.00,8841.48,120000.00,128841.48,2013,San Francisco
90525,90526,Thomas Tang,Police Officer 3,NaN,0.0,106079.31,0.00,106079.31,106079.31,2013,San Francisco
90786,90787,Michael C Hill,Deputy Sheriff,NaN,0.0,81299.02,23877.53,81299.02,105176.55,2013,San Francisco
...,...,...,...,...,...,...,...,...,...,...,...
110526,110527,Arthur L Curry,PS Aide Health Services,NaN,0.0,10.67,0.00,10.67,10.67,2013,San Francisco
110527,110528,Nereida Vega,Senior Clerk,NaN,0.0,5.56,0.00,5.56,5.56,2013,San Francisco
110528,110529,Timothy E Gibson,Police Officer 3,NaN,0.0,0.00,-2.73,0.00,-2.73,2013,San Francisco
110529,110530,Mark E Laherty,Police Officer 3,NaN,0.0,0.00,-8.20,0.00,-8.20,2013,San Francisco
110530,110531,David P Kucia,Police Officer 3,NaN,0.0,0.00,-33.89,0.00,-33.89,2013,San Francisco

In [24]:
# Fill the base pay null values with 0

clean["BasePay"]=clean["BasePay"].fillna(value=0)

In [25]:
#to check
clean["BasePay"].isna().sum()

0

In [26]:
# Check the null values of Benefits

clean[clean["Benefits"].isna()]

,Id,EmployeeName,JobTitle,BasePay,OvertimePay,OtherPay,Benefits,TotalPay,TotalPayBenefits,Year,Agency
0,1,NATHANIEL FORD,GENERAL MANAGER-METROPOLITAN TRANSIT AUTHORITY,167411.18,0.00,400184.25,NaN,567595.43,567595.43,2011,San Francisco
1,2,GARY JIMENEZ,CAPTAIN III (POLICE DEPARTMENT),155966.02,245131.88,137811.38,NaN,538909.28,538909.28,2011,San Francisco
2,3,ALBERT PARDINI,CAPTAIN III (POLICE DEPARTMENT),212739.13,106088.18,16452.60,NaN,335279.91,335279.91,2011,San Francisco
3,4,CHRISTOPHER CHONG,WIRE ROPE CABLE MAINTENANCE MECHANIC,77916.00,56120.71,198306.90,NaN,332343.61,332343.61,2011,San Francisco
4,5,PATRICK GARDNER,"DEPUTY CHIEF OF DEPARTMENT,(FIRE DEPARTMENT)",134401.60,9737.00,182234.59,NaN,326373.19,326373.19,2011,San Francisco
...,...,...,...,...,...,...,...,...,...,...,...
36154,36155,SERENA HUGHES,SWIMMING INSTRUCTOR/POOL LIFEGUARD,0.00,0.00,4.17,NaN,4.17,4.17,2011,San Francisco
36155,36156,JOE BROWN JR,TRANSIT OPERATOR,0.00,0.00,0.30,NaN,0.30,0.30,2011,San Francisco
36156,36157,PAULETTE ADAMS,"STATIONARY ENGINEER, WATER TREATMENT PLANT",0.00,0.00,0.00,NaN,0.00,0.00,2011,San Francisco
36157,36158,KAUKAB MOHSIN,TRANSIT OPERATOR,0.00,0.00,0.00,NaN,0.00,0.00,2011,San Francisco
36158,36159,JOSEPHINE MCCREARY,MANAGER IV,0.00,0.00,0.00,NaN,0.00,0.00,2011,San Francisco

In [27]:
# Fill the null value with 0 as it is not affecting TotalPayBenefits column

clean["Benefits"]=clean["Benefits"].fillna(value=0)

In [28]:
#to check

clean["Benefits"].isna().sum()

0

In [29]:
clean.describe().round(2)

,Id,BasePay,OvertimePay,OtherPay,Benefits,TotalPay,TotalPayBenefits,Year
count,148650.00,148650.00,148650.00,148650.00,148650.00,148650.00,148650.00,148650.00
mean,74325.50,66055.51,5066.06,3648.77,18924.74,74770.33,93695.08,2012.52
std,42911.70,42885.92,11454.38,8056.60,17165.23,50516.20,62792.50,1.12
min,1.00,-166.01,-0.01,-7058.59,-33.89,-618.13,-618.13,2011.00
25%,37163.25,32798.55,0.00,0.00,0.00,36169.96,44073.34,2012.00
50%,74325.50,64862.31,0.00,811.27,23217.14,71427.24,92406.02,2013.00
75%,111487.75,94609.72,4658.18,4236.07,33468.98,105842.96,132877.99,2014.00
max,148654.00,319275.01,245131.88,400184.25,96570.66,567595.43,567595.43,2014.00

### check why appear min is negtive

In [30]:
(clean["BasePay"]<0).sum()

11

In [31]:
clean[clean["OvertimePay"]<0]

,Id,EmployeeName,JobTitle,BasePay,OvertimePay,OtherPay,Benefits,TotalPay,TotalPayBenefits,Year,Agency
90714,90715,Claudia M Sanchez,Senior Eligibility Worker,75033.03,-0.01,1540.0,28864.64,76573.02,105437.66,2013,San Francisco

In [32]:
(clean["OtherPay"]<0).sum()

5

In [33]:
clean.head()

,Id,EmployeeName,JobTitle,BasePay,OvertimePay,OtherPay,Benefits,TotalPay,TotalPayBenefits,Year,Agency
0,1,NATHANIEL FORD,GENERAL MANAGER-METROPOLITAN TRANSIT AUTHORITY,167411.18,0.00,400184.25,0.0,567595.43,567595.43,2011,San Francisco
1,2,GARY JIMENEZ,CAPTAIN III (POLICE DEPARTMENT),155966.02,245131.88,137811.38,0.0,538909.28,538909.28,2011,San Francisco
2,3,ALBERT PARDINI,CAPTAIN III (POLICE DEPARTMENT),212739.13,106088.18,16452.60,0.0,335279.91,335279.91,2011,San Francisco
3,4,CHRISTOPHER CHONG,WIRE ROPE CABLE MAINTENANCE MECHANIC,77916.00,56120.71,198306.90,0.0,332343.61,332343.61,2011,San Francisco
4,5,PATRICK GARDNER,"DEPUTY CHIEF OF DEPARTMENT,(FIRE DEPARTMENT)",134401.60,9737.00,182234.59,0.0,326373.19,326373.19,2011,San Francisco

In [34]:
# Check the duplicate value from the data set

clean.duplicated().sum()

0

#### Save the cleaned file into csv with name clean_salary.csv

In [35]:
clean.to_csv("clean_salary.csv", index=False)

#### Read the clean_salary from the folder

In [36]:
sal = pd.read_csv('clean_salary.csv')

sal.head()

,Id,EmployeeName,JobTitle,BasePay,OvertimePay,OtherPay,Benefits,TotalPay,TotalPayBenefits,Year,Agency
0,1,NATHANIEL FORD,GENERAL MANAGER-METROPOLITAN TRANSIT AUTHORITY,167411.18,0.00,400184.25,0.0,567595.43,567595.43,2011,San Francisco
1,2,GARY JIMENEZ,CAPTAIN III (POLICE DEPARTMENT),155966.02,245131.88,137811.38,0.0,538909.28,538909.28,2011,San Francisco
2,3,ALBERT PARDINI,CAPTAIN III (POLICE DEPARTMENT),212739.13,106088.18,16452.60,0.0,335279.91,335279.91,2011,San Francisco
3,4,CHRISTOPHER CHONG,WIRE ROPE CABLE MAINTENANCE MECHANIC,77916.00,56120.71,198306.90,0.0,332343.61,332343.61,2011,San Francisco
4,5,PATRICK GARDNER,"DEPUTY CHIEF OF DEPARTMENT,(FIRE DEPARTMENT)",134401.60,9737.00,182234.59,0.0,326373.19,326373.19,2011,San Francisco

In [37]:
sal.isna().sum()

Id                  0
EmployeeName        0
JobTitle            0
BasePay             0
OvertimePay         0
OtherPay            0
Benefits            0
TotalPay            0
TotalPayBenefits    0
Year                0
Agency              0
dtype: int64

In [38]:
sal.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 148650 entries, 0 to 148649
Data columns (total 11 columns):
 #   Column            Non-Null Count   Dtype
---  ------            --------------   -----
 0   Id                148650 non-null  int64
 1   EmployeeName      148650 non-null  object
 2   JobTitle          148650 non-null  object
 3   BasePay           148650 non-null  float64
 4   OvertimePay       148650 non-null  float64
 5   OtherPay          148650 non-null  float64
 6   Benefits          148650 non-null  float64
 7   TotalPay          148650 non-null  float64
 8   TotalPayBenefits  148650 non-null  float64
 9   Year              148650 non-null  int64
 10  Agency            148650 non-null  object
dtypes: float64(6), int64(2), object(3)
memory usage: 12.5+ MB

### Questions

##### What is the average BasePay ?

In [39]:
sal['BasePay'].mean()

66055.50671774488

##### What is the highest amount of OvertimePay in the dataset ?

In [40]:
sal['OvertimePay'].max()

245131.88

##### What is the job title of  JOSEPH DRISCOLL ?

In [41]:
sal[sal['EmployeeName']=='JOSEPH DRISCOLL']['JobTitle']

24    CAPTAIN, FIRE SUPPRESSION
Name: JobTitle, dtype: object

##### How much does JOSEPH DRISCOLL make (including benefits)?

In [42]:
sal[sal['EmployeeName']=='JOSEPH DRISCOLL']['TotalPayBenefits']

24    270324.91
Name: TotalPayBenefits, dtype: float64

##### What is the name of highest paid person (including benefits)?

In [67]:
x=sal[sal['TotalPayBenefits']== sal['TotalPayBenefits'].max()]['EmployeeName']
# or
#sal.loc[sal['TotalPayBenefits'].idxmax()]
print(x[0])

NATHANIEL FORD

##### What is the name of lowest paid person (including benefits)?

In [70]:
sal[sal['TotalPayBenefits']== sal['TotalPayBenefits'].min()]['EmployeeName']
# or
# sal.loc[sal['TotalPayBenefits'].idxmax()]['EmployeeName']

148649    Joe Lopez
Name: EmployeeName, dtype: object

##### What was the average (mean) BasePay of all employees per year? (2011-2014) ?

In [45]:
sal.groupby('Year').mean()['BasePay']

Year
2011    63595.956517
2012    65436.406857
2013    68509.832156
2014    66564.421924
Name: BasePay, dtype: float64

##### How many unique job titles are there?

In [46]:
sal['JobTitle'].nunique()

2158

##### What are the top 5 most duplicate jobs?

In [47]:
sal['JobTitle'].value_counts().head()

Transit Operator                7036
Special Nurse                   4389
Registered Nurse                3736
Public Svc Aide-Public Works    2518
Police Officer 3                2421
Name: JobTitle, dtype: int64

##### How many people have the word Chief in their job title?

In [74]:
sal['JobTitle'].str.contains('Chief', case=False).sum()

627

In [48]:
def chief_string(title):
    if 'chief' in title.lower():
        return True
    else:
        return False

In [49]:
sal['JobTitle'].apply(chief_string).sum()

627

##### Total number of job titles which contain Captain

In [76]:
sal['JobTitle'].str.contains('CAPTAIN', case=False).sum()

552

##### How base pay allocated between different groups?

In [51]:
sal.groupby("JobTitle")["BasePay"].mean().sort_values(ascending=False)

JobTitle
Chief of Police                            309767.683333
Chief, Fire Department                     304232.340000
Gen Mgr, Public Trnsp Dept                 297769.413333
CHIEF OF DEPARTMENT, (FIRE DEPARTMENT)     285262.000000
Dep Dir for Investments, Ret               276153.765000
                                               ...
PUBLIC SAFETY COMMUNICATIONS TECHNICIAN         0.000000
Drug Court Coordinator                          0.000000
Public Safety Comm Tech                         0.000000
ASSISTANT RECREATION SUPERVISOR                 0.000000
IS Technician Assistant                         0.000000
Name: BasePay, Length: 2158, dtype: float64

##### Find Occurrence of The Employee Names (Top 5)

In [53]:
sal['EmployeeName'].value_counts().head()

Kevin Lee       13
William Wong    11
Richard Lee     11
Steven Lee      11
KEVIN LEE        9
Name: EmployeeName, dtype: int64

##### Find Average BasePay of Employees Having Job Title ACCOUNTANT

In [59]:
sal[sal['JobTitle'] == 'ACCOUNTANT']['BasePay'].mean()

46643.172